//输出二维数组的有关数据
#include<stdio.h>
int main(){
    int a[3][4]={1,3,5,7,9,11,13,15,17,19,21,23};
    printf("%d,%d\n",a,*a); //首行数组地址，首行首列元素地址

    printf("%d,%d\n",a[0],*(a+0)); //首行首列元素地址

    printf("%d,%d\n",&a[0],&a[0][0]);//首行数组地址，首行首列元素地址

    printf("%d,%d\n",a[1],a+1);//一行0列元素地址，一行数组地址

    printf("%d,%d\n",&a[1][0],*(a+1)+0);//一行0列元素地址

    printf("%d,%d\n",a[2],*(a+2));//2行0列元素地址

    printf("%d,%d\n",&a[2],a+2);//2行数组地址,

    printf("%d,%d\n",a[1][0],*(*(a+1)+0));//一行0列元素,

    printf("%d,%d\n",*a[2],*(*(a+2)+0));//2行0列元素     .......................................................................
    return 0;
}
